# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry..::..Value Property
AnalysisDisplayColorEntry Class See Also
---
Value associated with color entry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As Double
	Get
```

Visual C++
---
```text
public:
property double Value {
	double get ();
}
```

# See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace